[
  {
    "id": "gov-fdn",
    "name": "Governance Foundation",
    "about": "When reviewing any codebase, the first step is understanding the governance model, if it exists. This determines whether permissioned functions and elevated privileges are ultimately controlled by tokenholders.",
    "criteria": [
      {
        "id": "gov-fdn__workflow",
        "name": "On-chain Workflow Control",
        "about": "Does an on-chain workflow exist that gives holders ultimate voting power? (e.g., Timelocks or DAOs)."
      },
      {
        "id": "gov-fdn__access-control",
        "name": "Role Accountability",
        "about": "Are all significant privileged roles (those impacting value/ownership) gated by the holder workflow and revocable?"
      },
      {
        "id": "gov-fdn__concentration",
        "name": "Governance Concentration",
        "about": "does any one group control a majority share of the voting supply?"
      }
    ]
  },
  {
    "id": "token-ctrl",
    "name": "Metric 1: Token Control (On-chain)",
    "about": "Token ownership and protocol ownership are separate questions and must be analysed independently. The core question here is straightforward: can a third party meaningfully interfere with ownership of the token?",
    "criteria": [
      {
        "id": "token-ctrl__upgrade",
        "name": "Upgrade Sovereignty",
        "about": "Do holders control the upgrade logic via governance, or is the contract immutable?"
      },
      {
        "id": "token-ctrl__supply",
        "name": "Supply Sovereignty",
        "about": "Is the supply fixed/programmatic, or do holders control the minting process? (No third-party \"Minter\" roles)."
      },
      {
        "id": "token-ctrl__censorship",
        "name": "Censorship Immunity",
        "about": "Are there no \"Guardian\" or \"Admin\" roles capable of freezing, blacklisting, or seizing tokens?"
      }
    ]
  },
  {
    "id": "prot-ctrl",
    "name": "Metric 2: Protocol Control (On-chain)",
    "about": "Rather than analysing everything, we focus on what directly affects ownership and value. We look for two things: which contracts are in scope for tokenholder control and which privileged roles sit outside tokenholder control. This requires understanding the access-control patterns used in each contract, including proxies and upgrade mechanisms.",
    "criteria": [
      {
        "id": "prot-ctrl__upgrade",
        "name": "Upgrade Sovereignty",
        "about": "Do holders control the implementation logic of the specific \"Engine\" or product?"
      },
      {
        "id": "prot-ctrl__privileged",
        "name": "Gated Access Control",
        "about": "Are significant ownership restrictions or protocol parameters (risk/economic) gated specifically by holders?"
      }
    ]
  },
  {
    "id": "val-accrual",
    "name": "Metric 3: Value Accrual & Control (On-chain)",
    "about": "Value accrual matters alongside token and protocol control. Without it, ownership claims rely almost entirely on expectation rather than mechanism. Value can accrue indirectly through assets held by treasuries or contracts. Note that this is only accretive, strictly speaking, if tokenholders control those assets or the IP they fund.",
    "criteria": [
      {
        "id": "val-accrual__defined",
        "name": "Accrual Defined",
        "about": "Is a mechanism (even if latent/inactive) defined in the codebase or legal IP?"
      },
      {
        "id": "val-accrual__active",
        "name": "Accrual Active & Owned",
        "about": "Are value flows currently active and governed by holders (non-discretionary)?"
      },
      {
        "id": "val-accrual__treasury",
        "name": "Treasury Ownership",
        "about": "Is the protocol treasury programmatically controlled by the token-governance workflow?"
      },
      {
        "id": "val-accrual__mechanism",
        "name": "Accrual Mechanism Control",
        "about": "Can holders modify accrual parameters (e.g., changing fee splits or rates)?"
      }
    ]
  },
  {
    "id": "offchain",
    "name": "Metric 4: IP & Distribution (Off-chain)",
    "about": "Onchain ownership is only one half the story, in many cases. Distribution controls coordination. Even with immutable contracts, the ability to shift users to a fork or new deployment can break the link between existing tokenholders and future activity.",
    "criteria": [
      {
        "id": "offchain__brand",
        "name": "Brand",
        "about": "Are core trademarks and brand assets owned or controlled by a tokenholder-controlled legal entity?"
      },
      {
        "id": "offchain__distribution",
        "name": "Distribution",
        "about": "Are primary domains and distribution assets owned or controlled by a tokenholder-controlled legal entity?"
      },
      {
        "id": "offchain__licensing",
        "name": "Licensing",
        "about": "Is core protocol software/IP (and any associated licensing rights, where applicable) owned or controlled by a tokenholder-controlled legal entity?"
      }
    ]
  }
]
