[
  {
    "id": "onchain-ctrl",
    "name": "Metric 1: Onchain Control",
    "about": "This metric evaluates whether economically material outcomes are mediated through tokenholder governance, or whether admins, multisigs, security councils, or other privileged roles retain onchain powers that can change the rules or selectively restrict use and exit. Concretely, it maps who can upgrade core logic, change parameters, invoke emergency actions, modify token behavior or supply, freeze/blacklist/seize/force-transfer assets, or limit protocol actions and exit paths.",
    "criteria": [
      {
        "id": "onchain-ctrl__governance-workflow",
        "name": "On-chain Governance Workflow",
        "about": "Evaluates whether an onchain process exists that grants tokenholders ultimate authority over protocol decisions."
      },
      {
        "id": "onchain-ctrl__role-accountability",
        "name": "Role Accountability",
        "about": "Determines whether all privileged or value-impacting roles are governed, revocable, and accountable to tokenholders."
      },
      {
        "id": "onchain-ctrl__protocol-upgrade",
        "name": "Protocol Upgrade Authority",
        "about": "Determines whether core protocol logic can be upgraded and whether such upgrades are controlled by tokenholders."
      },
      {
        "id": "onchain-ctrl__token-upgrade",
        "name": "Token Upgrade Authority",
        "about": "Assesses whether token behavior can be modified and, if so, whether such changes are controlled by tokenholder governance."
      },
      {
        "id": "onchain-ctrl__supply",
        "name": "Supply Control",
        "about": "Evaluates whether token supply changes are programmatic or subject exclusively to tokenholder-approved governance processes."
      },
      {
        "id": "onchain-ctrl__access-gating",
        "name": "Privileged Access Gating",
        "about": "Assesses whether any bounded actor set can block or selectively restrict economically meaningful protocol actions or exit paths, versus access that is permissionless and symmetric for similarly situated users."
      },
      {
        "id": "onchain-ctrl__censorship",
        "name": "Token Censorship",
        "about": "Examines whether any roles exist that can freeze, blacklist, seize, or otherwise censor token balances or transfers."
      }
    ]
  },
  {
    "id": "val-accrual",
    "name": "Metric 2: Value Accrual",
    "about": "This metric evaluates whether the system's operation produces observable, onchain value flows (or token-scarcity effects) that accrue value to tokenholders under rule-based constraints that do not rely on manual transfers, trusted executors, or other unenforced expectations. It focuses on whether a real value engine exists and is active.",
    "criteria": [
      {
        "id": "val-accrual__active",
        "name": "Accrual Active",
        "about": "Assesses whether value flows to tokenholders are currently active rather than merely theoretical or proposed."
      },
      {
        "id": "val-accrual__treasury",
        "name": "Treasury Ownership",
        "about": "Determines whether protocol treasury assets are programmatically controlled by tokenholder governance."
      },
      {
        "id": "val-accrual__mechanism",
        "name": "Accrual Mechanism Control",
        "about": "Evaluates whether only tokenholders can modify parameters governing value capture, such as fees or revenue routing."
      },
      {
        "id": "val-accrual__offchain",
        "name": "Offchain Value Accrual",
        "about": "Are there additional offchain value accrual flows that benefit tokenholders?"
      }
    ]
  },
  {
    "id": "verifiability",
    "name": "Metric 3: Verifiability",
    "about": "This metric measures whether a token's economically material code and deployments are independently verifiable from primary evidence without relying on insider assurances. In practice, it answers: what code is running, where it is deployed, and whether the deployed bytecode can be credibly matched to publicly available source (including proxy implementations and build inputs where relevant).",
    "criteria": [
      {
        "id": "verifiability__token-source",
        "name": "Token Contract Source Verification",
        "about": "Determines whether the token contract's source code is publicly available and verifiably matches the deployed bytecode."
      },
      {
        "id": "verifiability__protocol-source",
        "name": "Protocol Component Source Verification",
        "about": "Determines whether core protocol contracts are publicly accessible and verifiable against their onchain deployments."
      }
    ]
  },
  {
    "id": "distribution",
    "name": "Metric 4: Token Distribution",
    "about": "This metric evaluates whether ownership and therefore effective voting power in governance is meaningfully distributed. It measures whether any single actor or coordinated group under common control can form a controlling block large enough to determine or constrain tokenholder-governed outcomes.",
    "criteria": [
      {
        "id": "distribution__concentration",
        "name": "Ownership Concentration",
        "about": "Measures whether a single actor or coordinated group controls a majority of the voting supply."
      },
      {
        "id": "distribution__supply-schedule",
        "name": "Future Token Unlocks",
        "about": "Are there known, future events (such as vesting cliffs) that will materially affect the concentration of tokens?"
      }
    ]
  },
  {
    "id": "offchain",
    "name": "Offchain Dependencies",
    "about": "Onchain ownership is only one half the story, in many cases. Distribution controls coordination. Even with immutable contracts, the ability to shift users to a fork or new deployment can break the link between existing tokenholders and future activity.",
    "criteria": [
      {
        "id": "offchain__trademark",
        "name": "Trademark",
        "about": "Are core trademarks and brand assets owned or controlled by a tokenholder-controlled legal entity?"
      },
      {
        "id": "offchain__distribution",
        "name": "Distribution",
        "about": "Are primary domains and distribution assets owned or controlled by a tokenholder-controlled legal entity?"
      },
      {
        "id": "offchain__licensing",
        "name": "Licensing",
        "about": "Is core protocol software/IP (and any associated licensing rights, where applicable) owned or controlled by a tokenholder-controlled legal entity?"
      }
    ]
  }
]
