{
  "lido": [
    {
      "id": "gov-fdn",
      "name": "Governance Foundation",
      "about": "When reviewing any codebase, the first step is understanding the governance model, if it exists. This determines whether permissioned functions and elevated privileges are ultimately controlled by tokenholders.",
      "criteria": [
        {
          "id": "gov-fdn__workflow",
          "name": "On-chain Workflow Control",
          "about": "Does an on-chain workflow exist that gives holders ultimate voting power? (e.g., Timelocks or DAOs).",
          "status": "✅",
          "notes": "Governance 1: Voting (LDO holders) → DualGovernance (stETH veto window) → EmergencyProtectedTimeLock (time delay) → Executor → Agent → Protocol Contracts. LDO holders have ultimate control, constrained by stETH veto.\n\nGovernance 2: Lido Easy Track is an optimistic governance system where certain operations can be vetoed by LDO holders but are assumed to pass. This primarily is used for treasury operations and management of certain staking modules. | Governance 1 flow: Voting (LDO holders) → DualGovernance (stETH veto window) → EmergencyProtectedTimeLock → Executor → Agent → Protocol Contracts\n\n**Governance 2 (Easy Track):** Whitelisted proposers (node ops, committees) create motions for predefined actions like staking limit increases or grants top-ups. Motions pass automatically unless ≥0.5% LDO objects within 72 hours. Permissionless execution post-timelock if unopposed; rejected motions escalate to full Aragon vote. Max 20 active motions; emergency dev multisig pause available.",
          "evidence": [
            {
              "name": "DualGovernance",
              "url": "https://etherscan.io/address/0xC1db28B3301331277e307FDCfF8DE28242A4486E#code"
            },
            {
              "name": "EmergencyProtectedTimeLock",
              "url": "https://etherscan.io/address/0xCE0425301C85c5Ea2A0873A2dEe44d78E02D2316#code"
            },
            {
              "name": "Executor",
              "url": "https://etherscan.io/address/0x23E0B465633FF5178808F4A75186E2F2F9537021#code"
            },
            {
              "name": "Agent",
              "url": "https://etherscan.io/address/0x3e40D73EB977Dc6a537aF587D48316feE66E9C8c"
            },
            {
              "name": "Easy Track Interface",
              "url": "https://easytrack.lido.fi/"
            },
            {
              "name": "Easy Track Guide",
              "url": "https://docs.lido.fi/guides/easy-track-guide"
            }
          ]
        },
        {
          "id": "gov-fdn__access-control",
          "name": "Access Control managed by Holders",
          "about": "Are all significant privileged roles (those impacting value/ownership) gated by the holder workflow and revocable?",
          "status": "✅",
          "notes": "All critical roles flow through governance-controlled contracts, ensuring LDO holders maintain ultimate control over the protocol.\n\nVoting: Voting contract is controlled by LDO holders.\n\nAgent: EXECUTE_ROLE is given to Executor. Executor is owned by EmergencyProtectedTimeLock, which is controlled by DualGovernance, which is controlled by Voting contract.\n\nTokenManager: MINT_ROLE is given to Voting contract. BURN_ROLE is given to no one as of now, but its permission manager is Voting contract.\n\nStakingRouter: STAKING_MODULE_MANAGE_ROLE is given to Agent contract. Since Agent is only callable by Governance 1, all operations are controlled by LDO holders.",
          "evidence": [
            {
              "name": "Agent",
              "url": "https://etherscan.io/address/0x3e40D73EB977Dc6a537aF587D48316feE66E9C8c"
            }
          ]
        },
        {
          "id": "gov-fdn__concentration",
          "name": "Governance Concentration",
          "about": "does any one group control a majority share of the voting supply?",
          "status": "TBD",
          "notes": "Aragon has not checked the distribution of LDO holders outside of the core team is >50%",
          "evidence": []
        }
      ]
    },
    {
      "id": "token-ctrl",
      "name": "Metric 1: Token Control (On-chain)",
      "about": "Token ownership and protocol ownership are separate questions and must be analysed independently. The core question here is straightforward: can a third party meaningfully interfere with ownership of the token?",
      "criteria": [
        {
          "id": "token-ctrl__upgrade",
          "name": "Upgrade Sovereignty",
          "about": "Do holders control the upgrade logic via governance, or is the contract immutable?",
          "status": "✅",
          "notes": "The LDO token contract is immutable with no proxy pattern. However, it has a controller address (TokenManager) that can call privileged functions (generateTokens, destroyTokens, enableTransfers, claimTokens). Additionally, the token’s doTransfer function includes a hook that calls the controller contract, which is upgradeable.\n\nSince TokenManager is upgradeable via Aragon proxy, the token’s behavior can be modified through controller upgrades, making LDO Token partially upgradeable in practice.\n\nUpgrading TokenManager requires calling setApp(tokenManager, …) on the Kernel, protected by APP_MANAGER_ROLE, which is assigned to the Agent contract.",
          "evidence": [
            {
              "name": "LDO Token",
              "url": "https://etherscan.io/token/0x5a98fcbea516cf06857215779fd812ca3bef1b32#code"
            },
            {
              "name": "TokenManager (Aragon App V1 proxy)",
              "url": "https://etherscan.io/address/0xf73a1260d222f447210581DDf212D915c09a3249"
            },
            {
              "name": "Kernel",
              "url": "https://etherscan.io/address/0xb8FFC3Cd6e7Cf5a098A1c92F48009765B24088Dc"
            }
          ]
        },
        {
          "id": "token-ctrl__supply",
          "name": "Supply Sovereignty",
          "about": "Is the supply fixed/programmatic, or do holders control the minting process? (No third-party \"Minter\" roles).",
          "status": "✅",
          "notes": "The LDO token’s controller (TokenManager) can mint unlimited tokens. However, minting requires MINT_ROLE on TokenManager, which is held by the Voting contract.\n\nThis enforces the minting path: Voting (LDO holders) → TokenManager → Token.generateTokens(). No supply cap exists, but all mints require tokenholder approval.",
          "evidence": [
            {
              "name": "MiniMeToken.generateTokens",
              "url": "https://github.com/aragon/minime/blob/1d5251fc88eee5024ff318d95bc9f4c5de130430/contracts/MiniMeToken.sol#L385"
            }
          ]
        },
        {
          "id": "token-ctrl__censorship",
          "name": "Censorship Immunity",
          "about": "Are there no \"Guardian\" or \"Admin\" roles capable of freezing, blacklisting, or seizing tokens?",
          "status": "✅",
          "notes": "Controller can burn tokens from any address and enable/disable transfers. Currently, BURN_ROLE on the TokenManager is given to no one, but permission manager is Voting contract. To enable burning, proposal must go through Governance 1 to call setPermission on ACL.",
          "evidence": [
            {
              "name": "MiniMeToken.destroyTokens",
              "url": "https://github.com/aragon/minime/blob/1d5251fc88eee5024ff318d95bc9f4c5de130430/contracts/MiniMeToken.sol#L401"
            },
            {
              "name": "MiniMeToken.enableTransfers",
              "url": "https://github.com/aragon/minime/blob/1d5251fc88eee5024ff318d95bc9f4c5de130430/contracts/MiniMeToken.sol#L419"
            },
            {
              "name": "Aragon ACL",
              "url": "https://etherscan.io/address/0x9895F0F17cc1d1891b6f18ee0b483B6f221b37Bb"
            }
          ]
        }
      ]
    },
    {
      "id": "prot-ctrl",
      "name": "Metric 2: Protocol Control (On-chain)",
      "about": "Rather than analysing everything, we focus on what directly affects ownership and value. We look for two things: which contracts are in scope for tokenholder control and which privileged roles sit outside tokenholder control. This requires understanding the access-control patterns used in each contract, including proxies and upgrade mechanisms.",
      "criteria": [
        {
          "id": "prot-ctrl__upgrade",
          "name": "Upgrade Sovereignty",
          "about": "Do holders control the implementation logic of the specific \"Engine\" or product?",
          "status": "✅",
          "notes": "The protocol contracts can be upgraded by the Agent contract (hence, by LDO holders).\n\nStakingRouter: proxy_getAdmin is set to Agent.\n\nAgent: Uses Aragon v1 Proxy. Upgrading requires calling setApp(Agent, …) on the Kernel, which requires APP_MANAGER_ROLE (currently given to Agent itself). Hence, upgrade is controlled by LDO holders.\n\nDualGovernance, Executor, EmergencyProtectedTimeLock: NOT upgradeable.",
          "evidence": [
            {
              "name": "StakingRouter",
              "url": "https://etherscan.io/address/0xfddf38947afb03c621c71b06c9c70bce73f12999#code"
            },
            {
              "name": "Agent",
              "url": "https://etherscan.io/address/0x3e40D73EB977Dc6a537aF587D48316feE66E9C8c"
            },
            {
              "name": "Kernel",
              "url": "https://etherscan.io/address/0xb8FFC3Cd6e7Cf5a098A1c92F48009765B24088Dc"
            }
          ]
        },
        {
          "id": "prot-ctrl__privileged",
          "name": "Privileged Access controlled by holders",
          "about": "Are significant ownership restrictions or protocol parameters (risk/economic) gated specifically by holders?",
          "status": "⚠️",
          "notes": "Users funds that have been deposited into Lido’s buffered ETH can only be deposited into a staking module by DepositSecurityModule which is controlled by Guardians, not LDO.",
          "evidence": [
            {
              "name": "DepositSecurityModule",
              "url": "https://etherscan.io/address/0xfFA96D84dEF2EA035c7AB153D8B991128e3d72fD#code"
            },
            {
              "name": "Lido.sol deposit logic",
              "url": "https://github.com/lidofinance/core/blob/d5d92266b5bb305044c5dcf3e407463f776a4def/contracts/0.4.24/Lido.sol#L641"
            }
          ]
        }
      ]
    },
    {
      "id": "val-accrual",
      "name": "Metric 3: Value Accrual & Control (On-chain)",
      "about": "Value accrual matters alongside token and protocol control. Without it, ownership claims rely almost entirely on expectation rather than mechanism. Value can accrue indirectly through assets held by treasuries or contracts. Note that this is only accretive, strictly speaking, if tokenholders control those assets or the IP they fund.",
      "criteria": [
        {
          "id": "val-accrual__active",
          "name": "Accrual Active & Owned",
          "about": "Are value flows currently active and governed by holders (non-discretionary)?",
          "status": "⚠️",
          "notes": "LDO token holders currently have no direct value accrual mechanism from protocol revenue. However, governance is exploring buyback mechanisms to return value to token holders, with proposals under consideration for liquid buyback execution using protocol treasury funds.",
          "evidence": [
            {
              "name": "Liquid buybacks research",
              "url": "https://research.lido.fi/t/liquid-buybacks-nest-execution-with-ldo-wsteth-liquidity/10894"
            }
          ]
        },
        {
          "id": "val-accrual__treasury",
          "name": "Treasury Ownership",
          "about": "Is the protocol treasury programmatically controlled by the token-governance workflow?",
          "status": "✅",
          "notes": "The Lido contract allows users to send ETH to the contract by the submit function and the contract puts the funds into buffered ETH and mints the according shares to the user.\n\nLater on, DepositSecurityModule calls the deposit function on the Lido contract and decides in which staking module to put the buffered ETH. StakingRouter is where each staking module can be added and updated (currently, there are 7 modules). When a staking module is added, the caller passes what treasury and stakingModule fee must be.",
          "evidence": [
            {
              "name": "Lido contract",
              "url": "https://etherscan.io/address/0x6ca84080381e43938476814be61b779a8bb6a600#code"
            },
            {
              "name": "DepositSecurityModule",
              "url": "https://etherscan.io/address/0xfFA96D84dEF2EA035c7AB153D8B991128e3d72fD#code"
            },
            {
              "name": "StakingRouter",
              "url": "https://etherscan.io/address/0xfddf38947afb03c621c71b06c9c70bce73f12999#code"
            }
          ]
        },
        {
          "id": "val-accrual__mechanism",
          "name": "Accrual Mechanism Control",
          "about": "Can holders modify accrual parameters (e.g., changing fee splits or rates)?",
          "status": "✅",
          "notes": "To add a new staking module or update it with new fees, full governance flow required, hence controlled by LDO holders.",
          "evidence": [
            {
              "name": "StakingRouter add/update",
              "url": "https://github.com/lidofinance/core/blob/cca04b42123735714d8c60a73c2f7af949e989db/contracts/0.8.9/StakingRouter.sol#L227"
            }
          ]
        }
      ]
    },
    {
      "id": "ip-dist",
      "name": "Metric 4: IP & Distribution (Off-chain)",
      "about": "Onchain ownership is only one half the story, in many cases. Distribution controls coordination. Even with immutable contracts, the ability to shift users to a fork or new deployment can break the link between existing tokenholders and future activity.",
      "criteria": [
        {
          "id": "ip-dist__brand",
          "name": "IP Ownership (Brand)",
          "about": "Is there evidence of DAO/holder ownership of trademarks, logos, and brand names?",
          "status": "❌",
          "notes": "European trademark registrations and the UK IPO Trademark Journal list the Lido Labs BORG Foundation (a memberless entity) as the owner, rather than the DAO or tokenholders directly.",
          "evidence": []
        },
        {
          "id": "ip-dist__npd",
          "name": "IP Ownership (NPD)",
          "about": "Do holders have legal rights to new product development (patents, trade secrets, proprietary codebase)?",
          "status": "⚠️",
          "notes": "There is no specific legal disclosure provided indicating that tokenholders have direct legal rights to patents or trade secrets; governance control is indirect through the BORG structure.",
          "evidence": []
        },
        {
          "id": "ip-dist__website",
          "name": "Distribution (Website)",
          "about": "Does the DAO/token entity own the primary domain (rather than an individual)?",
          "status": "⚠️",
          "notes": "While the DAO oversees the BORG, there is no public filing explicitly confirming the domain is legally owned by a tokenholder-governed entity rather than the Foundation or an individual.",
          "evidence": []
        },
        {
          "id": "ip-dist__socials",
          "name": "Distribution (Socials)",
          "about": "Does the DAO have administrative control over primary channels (X, Discord, Telegram)",
          "status": "⚠️",
          "notes": "Public research indicates the Lido DAO has defined governance controls over the BORG structure, which include overseeing the administrative channels and primary infrastructure.",
          "evidence": []
        }
      ]
    }
  ]
}
