{
  "crv": [
    {
      "id": "gov-fdn",
      "name": "Governance Foundation",
      "about": "When reviewing any codebase, the first step is understanding the governance model, if it exists. This determines whether permissioned functions and elevated privileges are ultimately controlled by tokenholders.",
      "criteria": [
        {
          "id": "gov-fdn__workflow",
          "name": "On-chain Workflow Control",
          "about": "Does an on-chain workflow exist that gives holders ultimate voting power? (e.g., Timelocks or DAOs).",
          "status": "✅",
          "notes": "Governance is enforced through Aragon v1's Voting Contract, which authorizes execution via the Agent contract.\n\nThe Agent contract is set as the owner for all protocol-gated functions, ensuring veCRV holders control all operations.",
          "evidence": [
            {
              "name": "Aragon Voting Contract",
              "url": "https://etherscan.io/address/0xe478de485ad2fe566d49342cbd03e49ed7db3356"
            },
            {
              "name": "Agent Contract",
              "url": "https://etherscan.io/address/0x40907540d8a6C65c637785e8f8B742ae6b0b9968"
            },
            {
              "name": "CRV Token Admin Check",
              "url": "https://etherscan.io/token/0xd533a949740bb3306d119cc777fa900ba034cd52#readContract"
            }
          ]
        },
        {
          "id": "gov-fdn__access-control",
          "name": "Access Control managed by Holders",
          "about": "Are all significant privileged roles (those impacting value/ownership) gated by the holder workflow and revocable?",
          "status": "✅",
          "notes": "Protocol roles are controlled by the Agent.\n\nGauge Addition: Only the DAO can add new gauges via add_gauge on GaugeController.\n\nFee Parameters: Pool admin fees are set at deployment and can be modified by Agent (through veCRV holders voting) - See accrual section for more info.\n\nPool Factory Ownership: new pools are deployed by Factory contracts which in turn is controlled by OwnerProxy contract. This contract has two types of admin set on it(Agent and GnosisSafe). Agent is responsible for adding new pools, hence giving veCRV holders control over protocol expansion.",
          "evidence": [
            {
              "name": "GaugeController",
              "url": "https://etherscan.io/address/0x2F50D438606C59853F044305d4073375218E06A1"
            }
          ]
        },
        {
          "id": "gov-fdn__concentration",
          "name": "Governance Concentration",
          "about": "does any one group control a majority share of the voting supply?",
          "status": "TBD",
          "notes": "Aragon has not verified if the majority of veCRV voting power lies with a single party",
          "evidence": []
        }
      ]
    },
    {
      "id": "token-ctrl",
      "name": "Metric 1: Token Control (On-chain)",
      "about": "Token ownership and protocol ownership are separate questions and must be analysed independently. The core question here is straightforward: can a third party meaningfully interfere with ownership of the token?",
      "criteria": [
        {
          "id": "token-ctrl__upgrade",
          "name": "Upgrade Sovereignty",
          "about": "Do holders control the upgrade logic via governance, or is the contract immutable?",
          "status": "✅",
          "notes": "The CRV token contract is immutable with no proxy patterns or upgrade mechanisms.",
          "evidence": [
            {
              "name": "ERC20CRV.vy Source",
              "url": "https://etherscan.io/token/0xd533a949740bb3306d119cc777fa900ba034cd52#code"
            }
          ]
        },
        {
          "id": "token-ctrl__supply",
          "name": "Supply Sovereignty",
          "about": "Is the supply fixed/programmatic, or do holders control the minting process? (No third-party \"Minter\" roles).",
          "status": "✅",
          "notes": "Curve’s token inflation is released in yearly epochs: each year allows a fixed maximum amount to be minted linearly over time, and at the end of the year the minting rate is reduced by a factor of 2^¼.\n\nAny unminted supply from a year is permanently lost. Mint can only occur by Minter which decides how much to mint for an user depending on the veCRV balance and provided LP tokens in a gauge.",
          "evidence": [
            {
              "name": "ERC20CRV.vy Yearly Epoch Logic",
              "url": "https://github.com/curvefi/curve-dao-contracts/blob/master/contracts/ERC20CRV.vy#L115C40-L115C59"
            },
            {
              "name": "ERC20CRV.vy Mint Access",
              "url": "https://github.com/curvefi/curve-dao-contracts/blob/fa127b1cb7bf83e4f3d605f7244b7b4ed5ebe053/contracts/ERC20CRV.vy#L333"
            },
            {
              "name": "Minter.vy Gauge Validation",
              "url": "https://github.com/curvefi/curve-dao-contracts/blob/master/contracts/Minter.vy#L46"
            }
          ]
        },
        {
          "id": "token-ctrl__censorship",
          "name": "Censorship Immunity",
          "about": "Are there no \"Guardian\" or \"Admin\" roles capable of freezing, blacklisting, or seizing tokens?",
          "status": "✅",
          "notes": "The CRV token has no transfer restrictions, blacklist functionality, or pausable transfers. There's Admin set (Agent) on the CRV token, but it can only update token's name and symbol.",
          "evidence": [
            {
              "name": "ERC20CRV.vy Standard Transfer",
              "url": "https://github.com/curvefi/curve-dao-contracts/blob/master/contracts/ERC20CRV.vy#L272"
            },
            {
              "name": "ERC20CRV.vy Metadata Logic",
              "url": "https://github.com/curvefi/curve-dao-contracts/blob/fa127b1cb7bf83e4f3d605f7244b7b4ed5ebe053/contracts/ERC20CRV.vy#L365"
            }
          ]
        }
      ]
    },
    {
      "id": "prot-ctrl",
      "name": "Metric 2: Protocol Control (On-chain)",
      "about": "Rather than analysing everything, we focus on what directly affects ownership and value. We look for two things: which contracts are in scope for tokenholder control and which privileged roles sit outside tokenholder control. This requires understanding the access-control patterns used in each contract, including proxies and upgrade mechanisms.",
      "criteria": [
        {
          "id": "prot-ctrl__upgrade",
          "name": "Upgrade Sovereignty",
          "about": "Do holders control the implementation logic of the specific \"Engine\" or product?",
          "status": "✅",
          "notes": "Core protocol and pool contracts are immutable.\n\nAgent Contract: The Agent contract can be upgraded by calling setApp(Agent, ...) on the Kernel contract, which is only allowed by the Agent itself. This means only veCRV holders can upgrade the Agent contract through governance voting.\n\nVoting Contract: The voting contract can be upgraded by calling setApp(Voting, ...) on the Kernel contract, which is only allowed by the Agent itself. This means only veCRV holders can upgrade the Voting contract through governance voting.",
          "evidence": [
            {
              "name": "CRV Token (Admin: Agent)",
              "url": "https://etherscan.io/address/0xd533a949740bb3306d119cc777fa900ba034cd52"
            },
            {
              "name": "GaugeController (Admin: Agent)",
              "url": "https://etherscan.io/address/0x2F50D438606C59853F044305d4073375218E06A1"
            }
          ]
        },
        {
          "id": "prot-ctrl__privileged",
          "name": "Privileged Access controlled by holders",
          "about": "Are significant ownership restrictions or protocol parameters (risk/economic) gated specifically by holders?",
          "status": "✅",
          "notes": "Core protocol functions are either permissionless or gated by Agent contract (hence veCRV holders). For gate control related to fees/revenues, see accrual section.\n\nAdd/Kill Gauge: To add a new gauge in GaugeController, veCRV holders must vote in majority. The admin on GaugeController is set to the Aragon Agent Contract, which sits as the final step in the governance process. Governance starts with the Aragon Voting contract that uses veCRV token for voting.\n\nveCRV holders can also kill a gauge, permanently setting its rewards to 0.",
          "evidence": [
            {
              "name": "Gauge Kill Implementation",
              "url": "https://github.com/curvefi/curve-dao-contracts/blob/master/contracts/GaugeController.vy"
            }
          ]
        }
      ]
    },
    {
      "id": "val-accrual",
      "name": "Metric 3: Value Accrual & Control (On-chain)",
      "about": "Value accrual matters alongside token and protocol control. Without it, ownership claims rely almost entirely on expectation rather than mechanism. Value can accrue indirectly through assets held by treasuries or contracts. Note that this is only accretive, strictly speaking, if tokenholders control those assets or the IP they fund.",
      "criteria": [
        {
          "id": "val-accrual__active",
          "name": "Accrual Active & Owned",
          "about": "Are value flows currently active and governed by holders (non-discretionary)?",
          "status": "✅",
          "notes": "CRV Emissions Rewards: Liquidity Providers deposit LP tokens into the Gauge Contract. LPs claim proportional rewards.\n\n2.5x Boost in CRV Emissions: LPs can boost rewards by locking CRV for veCRV. Enforced by TOKENLESS_PRODUCTION.\n\nPool rewards in crvUSD: StableSwapProxy calls withdraw_admin_fees. Fees converted to crvUSD via CowSwapBurner and sent to FeeDistributor for veCRV holders.\n\nBorrow rewards in crvUSD: Interest from controllers sent to FeeSplitter. FeeCollector receives proportional crvUSD and sends to FeeDistributor for veCRV holders.",
          "evidence": [
            {
              "name": "FeeDistributor 2",
              "url": "https://etherscan.io/address/0xD16d5eC345Dd86Fb63C6a9C43c517210F1027914"
            },
            {
              "name": "FeeSplitter",
              "url": "https://etherscan.io/address/0x733f5E148f470530932822162608492C07D7f0Cc"
            }
          ]
        },
        {
          "id": "val-accrual__treasury",
          "name": "Treasury Ownership",
          "about": "Is the protocol treasury programmatically controlled by the token-governance workflow?",
          "status": "✅",
          "notes": "50% of all trading fees are distributed to veCRV holders through crvUSD rewards, while the remaining 50% goes to the respective liquidity providers of the pools.\n\nOnly veCRV holders can change this behaviour, hence Curve has no separate treasury. All revenue to the people.",
          "evidence": [
            {
              "name": "Earning-fees",
              "url": "https://resources.curve.finance/vecrv/overview#earning-fees"
            }
          ]
        },
        {
          "id": "val-accrual__mechanism",
          "name": "Accrual Mechanism Control",
          "about": "Can holders modify accrual parameters (e.g., changing fee splits or rates)?",
          "status": "✅",
          "notes": "Gauge weights are determined programmatically by veCRV votes, not discretionary decisions.\n\nUpdate Pool Fees: Pool fee changes are executed via commit_new_fee, which can only be called by the pool owner — StableSwapProxy. Restricted to parameter_admin (Agent contract).\n\nAttaching a burner contract: set_burner on StableSwapProxy gated by ownership_admin (Agent contract).\n\nBurn: The burn function invokes each coin's attached burner contract. Can be disabled by either the Agent contract or the emergency Safe multisig.",
          "evidence": [
            {
              "name": "StableSwapProxy",
              "url": "https://etherscan.io/address/0x8F942C20D02bF323dec196048239361b5ae7ec94"
            }
          ]
        }
      ]
    },
    {
      "id": "ip-dist",
      "name": "Metric 4: IP & Distribution (Off-chain)",
      "about": "Onchain ownership is only one half the story, in many cases. Distribution controls coordination. Even with immutable contracts, the ability to shift users to a fork or new deployment can break the link between existing tokenholders and future activity.",
      "criteria": [
        {
          "id": "ip-dist__brand",
          "name": "IP Ownership (Brand)",
          "about": "Is there evidence of DAO/holder ownership of trademarks, logos, and brand names?",
          "status": "❌",
          "notes": "The Curve trademark is owned by Swiss Stake AG (a Swiss company), not the DAO or veCRV holders directly.",
          "evidence": []
        },
        {
          "id": "ip-dist__npd",
          "name": "IP Ownership (NPD)",
          "about": "Do holders have legal rights to new product development (patents, trade secrets, proprietary codebase)?",
          "status": "⚠️",
          "notes": "New product development is conducted by contributors without explicit legal assignment of IP rights to tokenholders. Governance control is indirect through on-chain voting.",
          "evidence": []
        },
        {
          "id": "ip-dist__website",
          "name": "Distribution (Website)",
          "about": "Does the DAO/token entity own the primary domain (rather than an individual)?",
          "status": "⚠️",
          "notes": "The curve.fi domain is controlled by Swiss Stake AG. While the DAO governs the protocol, there is no public legal structure confirming tokenholder ownership of the primary distribution channel.",
          "evidence": []
        },
        {
          "id": "ip-dist__socials",
          "name": "Distribution (Socials)",
          "about": "Does the DAO have administrative control over primary channels (X, Discord, Telegram)",
          "status": "❌",
          "notes": "Primary social media channels are managed by Swiss Stake AG and core contributors, with no explicit on-chain governance control over messaging or account access.",
          "evidence": []
        }
      ]
    }
  ]
}
